{
    "banners":[
        {
            "file_name": "offer1.jpg",
            "alt": "Dwa monitory komputera stojące na blacie biurka",
            "title": "Funkcjonalność",
            "description": "Decydując się na umieszczenie strony internetowej w sieci kierujemy się zawsze jakąś potrzebą. Bez względu na to, czy jest to chęć dotarcia do nowych klientów, zaistnienia z jakimś ciekawym projektem, czy może po prostu chcemy wymienić poglądy z kimś o podobnych zainteresowaniach, zawsze wymagamy, aby nasza strona spełniała nasze oczekiwania. Właściwa funkcjonalność jest najważniejszą rzeczą, na jaką musimy zwrócić uwagę. Nie miałoby większego sensu skupiać się na umieszczeniu ciężkiej i rozbudowanej grafiki na stronie przeznaczonej do czatowania, czy też zakładanie sklepu internetowego ze słabo dopracowanym koszykiem. Rozumiejąc te potrzeby jesteśmy w stanie zapewnić odpowiednią efektywność projektowanej strony internetowej."
        },{
            "file_name": "offer2.jpg",
            "alt": "Ekran komputera z wyświetlonym kodem",
            "title": "Komunikacja",
            "description": "Zrozumienie potrzeb osób chcących umieścić w sieci swoją stronę jest niezbędne, aby zapewnić odpowiednią jej funkcjonalność. Komunikacja pomiędzy zleceniodawcą i projektantem strony często bywa utrudniona z uwagi na rożne doświadczenie zawodowe, przez co projektanci nie zawsze rozumieją czego się od nich oczekuje. Wieloletnie doświadczenie w branży technicznej pozwala nam na łatwą komunikację z firmami produkcyjnymi i zajmującymi się handlem technicznym, natomiast otwartość na specyficzne wymagania pozwala na realizację nawet najbardziej nietypowych zleceń."
        },{
            "file_name": "offer3.jpg",
            "alt": "Smartfon trzymany w ręce",
            "title": "Responsywność",
            "description": "Urządzenia mobilne bez wątpienia stają się głównym źródłem pozyskiwania informacji. Obecnie obserwujemy próbę uzyskania kompromisu pomiędzy wielkością wyświetlacza, a miniaturyzacją urządzenia. Responsywność, czyli automatyczne dopasowywanie się stron do wielkości ekranu jest tym, czego wymagać musimy od każdej strony internetowej. Mobile First Design zmienia całkowicie sposób projektowania stron, gdzie sama responsywność jest tylko jednym z elementów. Zakładając możliwość korzystania z różnorodnych urządzeń, a właściwe projektując pod te urządzenia strony od podstaw jesteśmy w stanie uzyskać bezkolizyjne ich działanie w przyszłości."
        }
    ],
    "textes":{
        "header1": "Specjalizujemy się w stronach dla przemysłu technicznego",
        "header2": "Technologie"
    },
    "logos":[
        {
            "file_name": "logo_html.png",
            "alt": "logo HTML",
            "title": "HTML",
            "link": "https://www.w3.org/html/"
        },{
            "file_name": "logo_css.png",
            "alt": "logo CSS",
            "title": "CSS",
            "link": "https://www.w3.org/Style/CSS/Overview.en.html"
        },{
            "file_name": "logo_javascript.png",
            "alt": "logo JavaScript",
            "title": "JavaScript",
            "link": "https://www.ecma-international.org/"
        },{
            "file_name": "logo_sass.png",
            "alt": "logo SASS",
            "title": "SASS",
            "link": "https://sass-lang.com/"
        },{
            "file_name": "logo_jquery.png",
            "alt": "logo jQuery",
            "title": "jQuery",
            "link": "https://jquery.com/"
        },{
            "file_name": "logo_angularjs.png",
            "alt": "logo AngularJS",
            "title": "AngularJS",
            "link": "https://angularjs.org/"
        },{
            "file_name": "logo_php.png",
            "alt": "logo PHP",
            "title": "PHP",
            "link": "https://www.php.net/"
        },{
            "file_name": "logo_mysql.png",
            "alt": "logo MySql",
            "title": "MySql",
            "link": "https://www.mysql.com/"
        }
    ]
}
