{
    "banners":[
        {
            "file_name": "offer1.jpg",
            "alt": "Dwa monitory komputera stojące na blacie biurka",
            "title": "Projektowanie",
            "description": "Za decyzją o postawieniu strony internetowej, czy stworzeniu aplikacji stoi zawsze chęć rozwiązania jakiegoś problemu i jedynie poprzez nasze indywidualne podejście do projektowania jesteśmy w stanie go zrozumieć i dostarczyć odpowiednie rozwiązanie. Tak, jak w przypadku aplikacji, strona musi przede wszystkim spełnić swoją funkcję i nie chodzi tu jedynie o dobór odpowiednich grafik, czy animacji. Są one tylko narzędziem, które wykorzystujemy do osiągnięcia celu jakim może być np. lepsze dotarcie do odbiorcy. Podczas projektowania nie skupiamy się na narzędziach, ale na analizie funkcji, jaką ma pełnić dana strona, czy aplikacja, a dopiero wtedy do tej funkcji dobieramy odpowiednie narzędzia."
        },{
            "file_name": "offer2.jpg",
            "alt": "Ekran komputera z wyświetlonym kodem",
            "title": "Pisanie kodu",
            "description": "Jednym z głównych naszych zadań jest oczywiście pisanie kodu. Skupiamy się przede wszystkim na jego optymalizacji, ponieważ dzięki temu uzyskujemy szybsze czasy ładowania oraz lepszą stabilność aplikacji. Jednocześnie, dbamy też o jego czytelność, aby łatwiej, a co za tym idzie taniej, można było go rozbudowywać w przyszłości dodając nowe funkcjonalności. Dbamy również o tzw. dostępność, czyli wymagania WCAG 2.0, które stają się coraz bardziej istotne i mają coraz większy wpływ na pozycjonowanie stron (SEO)."
        },{
            "file_name": "offer3.jpg",
            "alt": "Smartfon trzymany w ręce",
            "title": "Responsywność",
            "description": "Responsive Web Design (RWD) jest to automatyczne dopasowywanie się stron i aplikacji do wielkości ekranu urządzenia, na którym są one wyświetlane. Dzięki RWD ta sama strona będzie czytelna zarówno na dużym ekranie laptopa lub telewizora, jak i na małym wyświetlaczu tableta, czy smartfona. RWD jest u nas standardem i rezygnujemy z niego jedynie na specjalne życzenie klienta. Ponadto, oferujemy również podeście Mobile First Design, polegające na projektowaniu w pierwszej kolejności na urządzenia mobilne, a następnie rozbudowywaniu widoku na większe wyświetlacze."
        }
    ],
    "textes":{
        "header1": "Specjalizujemy się w stronach dla przemysłu technicznego",
        "header2": "Technologie"
    },
    "logos":[
        {
            "file_name": "logo_html.png",
            "alt": "logo HTML",
            "title": "HTML",
            "link": "https://www.w3.org/html/"
        },{
            "file_name": "logo_css.png",
            "alt": "logo CSS",
            "title": "CSS",
            "link": "https://www.w3.org/Style/CSS/Overview.en.html"
        },{
            "file_name": "logo_javascript.png",
            "alt": "logo JavaScript",
            "title": "JavaScript",
            "link": "https://www.ecma-international.org/"
        },{
            "file_name": "logo_sass.png",
            "alt": "logo SASS",
            "title": "SASS",
            "link": "https://sass-lang.com/"
        },{
            "file_name": "logo_jquery.png",
            "alt": "logo jQuery",
            "title": "jQuery",
            "link": "https://jquery.com/"
        },{
            "file_name": "logo_angularjs.png",
            "alt": "logo AngularJS",
            "title": "AngularJS",
            "link": "https://angularjs.org/"
        },{
            "file_name": "logo_php.png",
            "alt": "logo PHP",
            "title": "PHP",
            "link": "https://www.php.net/"
        },{
            "file_name": "logo_mysql.png",
            "alt": "logo MySql",
            "title": "MySql",
            "link": "https://www.mysql.com/"
        }
    ]
}
